[graphicalobject]
Name=Lsysinfo
Help= ;
x=187
y=14
width=273
height=64
Activate=1
rc-dll=hpleo008.dll
Z-Order=0


[ToolDescriptor]
4=BubbleMessage,statuslist,hpgwct02.dll
1=OK,pushbutton,hpgbut02.dll
2=Help,pushbutton,hpgbut02.dll
3=MessageText,static,hpgwct02.dll

[static MessageText]
x=18
y=15
width=120
height=25
Help=メソッド情報テキストがここにきます。
Text1=メソッド コメント フィールド: ここに表示します。
Text=
Font=bold
BKCOLOR=ErrorBkColor
TextColor=ErrorTextColor



[pushbutton OK]
;x=139
x=137
;y=25
y=13
width=15
height=15
Help=このボタンを押すとエラー メッセージを隠します。
ImageList=RBMP.OKCHECKMARK|RBMP.OKCHECKMARK|RBMP.OKCHECKMARK|RBMP.OKCHECKMARK
Command=GomDelete lsyscont, lsysinfo
Font=bold


[pushbutton Help]
x=137
y=27
width=15
height=15
Help=このボタンを押すとエラー メッセージを隠します。
ImageList=RBMP.HELPMARK|RBMP.HELPMARK|RBMP.HELPMARK|RBMP.HELPMARK
Command=help.topic 3220
Font=bold





[fontalias]
1=bold|ＭＳ Ｐゴシック,9,bold
2=normal|ＭＳ Ｐゴシック,9,normal

[coloralias]
1=InfoTextColor|0,0,0
2=InfoBkColor|192,192,192
3=ErrorTextColor|255,255,255
4=ErrorBkColor|255,0,0
5=WarningTextColor|0,0,0
6=WarningBkColor|255,255,0
7=WaitingTextColor|255,255,255
8=WaitingBkColor|255,0,255


;5=Yellow|255,255,0
;6=DisableColor|128,128,128
;8=GRAY|192,192,192



[statuslist BubbleMessage]
delayed=0
enable=0
x=-16
y=0
width=190
height=64
;Cursor=Hand
Help=システム ステータスを渡します。
Image1=RBMP.SpeechBlack
x1=0
y1=0
ROP1=SCRCOPY
Image2=RBMP.TalkMethod
x2=17
y2=9
ROP2=SCRCOPY
Image7=Status / Error
x7=23
y7=20
Image8=message text
x8=23
y8=33
Symbols1=Mth|Inj|Pump|Column|Det1|Det2|Det3|DA|ERROR|WARNING|INFO|WAITING
Elements=Inj|ERROR
;Command=@view.floatingmenu "menu[1]", "LeoALS"
ImageStart=1
ElementStart=1
ElementEnd=2
Font=bold
RcDll=hpleo008.dll
RcDll1=hpleo008.dll
Mth=RBMP.SpeechMethod
Inj=RBMP.SpeechInjector
Pump=RBMP.SpeechPump
Column=RBMP.SpeechColumn
Det1=RBMP.SpeechInjector
Det2=RBMP.SpeechInjector
Det3=RBMP.SpeechInjector
DA=RBMP.TalkInjector
ERROR=RBMP.SpeechError
WARNING=RBMP.SpeechWARNING
INFO=RBMP.SpeechInfo
WAITING=RBMP.SpeechHiWarning

[statuslist Time_OLD]
x=176
y=48
width=114
height=18
Help=システム ランの時間を表示
Font=bold
BKColor=GRAY
RcDll1=hpleo008.dll
Image1= %7.2f min
value1=17
Image2=RUN
justify1=right
justify2=right
x1=110
y1=13
x2=46
y2=13
;Image3=
x3=500
y3=500


